# 주석이란?
#(1)
# 파이썬 주석 처리

#(2)
''' 여러줄 주석 '''

#(3)
""" 여러줄 주석 """

# 2_숫자형
#[1] 정수형
print(123)
print(-128)
print(0)
#[2] 실수형
print(1.2)
print(-3.45)
print(4.24E10)
print(-4.24e-4)
    # 지수 : E 또는 e
print(4.24E4)   # 4.24*10(10제곱)
print(4.24e-4)  # 4.24*10(-10제곱)
#[3] 8진수 16진수
    # 2진수: 0,1
    # 8진수: 0,1,2,3,4,5,6,7
    # 10진수: 0,1,2,3,4,5,6,7,8,9
    # 16진수: 0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F
print(0o177) # 0(숫자)o(알파벳소문자) 으로 시작하면 8진수 표현
    #177(8) ---> 127(10)
print(0x8ff) # 0(숫자)x(알파벳소문자) 으로 시작하면 16진수 표현
    #8ff(16) ---> 2303(10)
print(0xABC)
    #ABC(16) --->2748(10)
print(0o10) #10(8) ---> 8(10)
print(0x10) #10(16) ---> 16(10)

#[4] 사칙연산
print(3+4) #7
print(3-4) #-1
print(3*4) #12
print(3/4) #0.75
print(3//4) #0(몫)
print(3%4) #3(나머지)
print(3**4) #제곱81
print(10*18**2+2*11)